SpenceKonde/megaTinyCore/megaavr/boards.txt
atxy2.upload.tool=avrdude

atxy2.bootloader.flashcommand=

atxy2.bootloader.tool=avrdude

atxy2.menu.uartpins.alternate=TX:2, RX:3
atxy2.menu.uartpins.standard=TX:0, RX:1
atxy2.menu.uartpins.alternate.build.uartpins=-DUARTREMAP
atxy2.menu.uartpins.standard.build.uartpins=
atxy2.menu.spipins.standard=SCK:4, MISO:3, MOSI:2 
atxy2.menu.spipins.alternate=SCK:4, MISO:1, MOSI:0
atxy2.menu.spipins.alternate.build.spipins=-DSPIREMAP
atxy2.menu.spipins.standard.build.spipins=

atxy2.build.board=attinyxy2
atxy2.build.core=arduino
atxy2.build.variant=txy2
atxy2.build.text_section_start=.text=0x0
atxy2.build.extra_flags=-DMILLIS_USE_TIMERA0 -DNO_EXTERNAL_I2C_PULLUP {build.dacvref} -DNEOPIXELPORT=VPORTA.OUT {build.millis} {build.uartpins} {build.spipins}
atxy2.build.export_merged_output=false

atxy2.bootloader.tool=avrdude
atxy2.bootloader.WDTCFG=0x00
atxy2.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
atxy2.bootloader.TCD0CFG=0x00
atxy2.bootloader.SYSCFG0=0xC9
atxy2.bootloader.SYSCFG1=0x03
atxy2.bootloader.APPEND=0x00
atxy2.bootloader.BOOTEND=0x00

#

# Xplained boards with Tiny-1 chips

Xplained416.name=Attiny416 Xplained Nano (optiboot)
Xplained416.build.mcu=attiny416
Xplained416.build.board=attinyxy6
Xplained416.build.core=arduino
Xplained416.build.variant=txy6
Xplained416.build.f_cpu=20000000
Xplained416.build.text_section_start=.text=0x200
Xplained416.build.extra_flags=-DMILLIS_USE_TIMERA0 -DNO_EXTERNAL_I2C_PULLUP -DUSE_TIMERD0_PWM -DDACVREF=3 -DNEOPIXELPORT=VPORTA.OUT
Xplained416.upload.tool=avrdude
Xplained416.upload.workaround=
Xplained416.upload.speed=57600
Xplained416.upload.maximum_size=3584
Xplained416.upload.maximum_data_size=256
Xplained416.upload.protocol=arduino
Xplained416.upload.extra_params=-D
Xplained416.bootloader.file=optiboot_x/optiboot_xplained416.hex
Xplained416.bootloader.flashcommand=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
Xplained416.bootloader.tool=avrdude
Xplained416.bootloader.BOOTEND=0x2
Xplained416.bootloader.OSCCFG=0x02
Xplained416.bootloader.WDTCFG=0x00
Xplained416.bootloader.BODCFG=0b00000000
Xplained416.bootloader.TCD0CFG=0x00
Xplained416.bootloader.SYSCFG0=0xC9
Xplained416.bootloader.SYSCFG1=0x03
Xplained416.bootloader.APPEND=0x00

Xplained817.name=Attiny817 Xplained Mini (optiboot)
Xplained817.build.mcu=attiny817
Xplained817.build.board=attinyxy7
Xplained817.build.core=arduino
Xplained817.build.variant=txy7
Xplained817.build.f_cpu=20000000
Xplained817.build.text_section_start=.text=0x200
Xplained817.build.extra_flags=-DMILLIS_USE_TIMERA0 -DNO_EXTERNAL_I2C_PULLUP -DUSE_TIMERD0_PWM -DDACVREF=3 -DNEOPIXELPORT=VPORTA.OUT
Xplained817.upload.tool=avrdude
Xplained817.upload.workaround=
Xplained817.upload.speed=57600
Xplained817.upload.maximum_size=7680
Xplained817.upload.maximum_data_size=512
Xplained817.upload.protocol=arduino
Xplained817.upload.extra_params=-D
Xplained817.bootloader.file=optiboot_x/optiboot_xplained817.hex
Xplained817.bootloader.flashcommand=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
Xplained817.bootloader.tool=avrdude
Xplained817.bootloader.BOOTEND=0x2
Xplained817.bootloader.OSCCFG=0x02
Xplained817.bootloader.WDTCFG=0x00
Xplained817.bootloader.BODCFG=0b00000000
Xplained817.bootloader.TCD0CFG=0x00
Xplained817.bootloader.SYSCFG0=0xC9
Xplained817.bootloader.SYSCFG1=0x03

# Separate board types for chips with Optiboot.  Reduces menu clutter.

atxy7o.name=ATtiny3217/1617/1607/817/807/417 (Optiboot)
atxy7o.upload.speed=115200

atxy7o.menu.chip.3217=ATtiny3217
atxy7o.menu.chip.3217.build.mcu=attiny3217
atxy7o.menu.chip.3217.upload.maximum_size=32256
atxy7o.menu.chip.3217.upload.maximum_data_size=2048
atxy7o.menu.chip.1617=ATtiny1617
atxy7o.menu.chip.1617.build.mcu=attiny1617
atxy7o.menu.chip.1617.upload.maximum_size=15872
atxy7o.menu.chip.1617.upload.maximum_data_size=2048
atxy7o.menu.chip.817=ATtiny817
atxy7o.menu.chip.817.build.mcu=attiny817
atxy7o.menu.chip.817.upload.maximum_size=7680
atxy7o.menu.chip.817.upload.maximum_data_size=512
atxy7o.menu.chip.417=ATtiny417
atxy7o.menu.chip.417.build.mcu=attiny417
atxy7o.menu.chip.417.upload.maximum_size=3584
atxy7o.menu.chip.417.upload.maximum_data_size=256
atxy7o.menu.chip.1607=ATtiny1607
atxy7o.menu.chip.1607.build.mcu=attiny1607
atxy7o.menu.chip.1607.upload.maximum_size=15872
atxy7o.menu.chip.1607.upload.maximum_data_size=1024
atxy7o.menu.chip.807=ATtiny807
atxy7o.menu.chip.807.build.mcu=attiny807
atxy7o.menu.chip.807.upload.maximum_size=7680
atxy7o.menu.chip.807.upload.maximum_data_size=512

atxy7o.menu.clock.20=20 MHz
atxy7o.menu.clock.16=16 MHz
atxy7o.menu.clock.10=10 MHz
atxy7o.menu.clock.8=8 MHz
atxy7o.menu.clock.5=5 MHz
atxy7o.menu.clock.4=4 MHz
atxy7o.menu.clock.1=1 MHz
atxy7o.menu.clock.20.build.f_cpu=20000000L
atxy7o.menu.clock.16.build.f_cpu=16000000L
atxy7o.menu.clock.10.build.f_cpu=10000000L
atxy7o.menu.clock.8.build.f_cpu=8000000L
atxy7o.menu.clock.5.build.f_cpu=5000000L
atxy7o.menu.clock.4.build.f_cpu=4000000L
atxy7o.menu.clock.1.build.f_cpu=1000000L
atxy7o.menu.clock.20.bootloader.OSCCFG=0x02
atxy7o.menu.clock.16.bootloader.OSCCFG=0x01
atxy7o.menu.clock.10.bootloader.OSCCFG=0x02
atxy7o.menu.clock.8.bootloader.OSCCFG=0x01
atxy7o.menu.clock.5.bootloader.OSCCFG=0x02
atxy7o.menu.clock.4.bootloader.OSCCFG=0x01
atxy7o.menu.clock.1.bootloader.OSCCFG=0x01

atxy7o.menu.bodvoltage.1v8=1.8V
atxy7o.menu.bodvoltage.2v15=2.15V
atxy7o.menu.bodvoltage.2v6=2.6V
atxy7o.menu.bodvoltage.2v95=2.95V
atxy7o.menu.bodvoltage.3v3=3.30V
atxy7o.menu.bodvoltage.3v7=3.70V
atxy7o.menu.bodvoltage.4v0=4.00V
atxy7o.menu.bodvoltage.4v3=4.30V
atxy7o.menu.bodvoltage.4v3.bootloader.bodlevbits=111
atxy7o.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy7o.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy7o.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy7o.menu.bodvoltage.2v95.bootloader.bodlevbits=011
atxy7o.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy7o.menu.bodvoltage.2v15.bootloader.bodlevbits=001
atxy7o.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy7o.menu.bodmodeactive.disabled=Disabled
atxy7o.menu.bodmodeactive.enabled=Enabled
atxy7o.menu.bodmodeactive.sampled=Sampled
atxy7o.menu.bodmodeactive.enabledhold=Enabled hold wakeup
atxy7o.menu.bodmodesleep.disabled=Disabled
atxy7o.menu.bodmodesleep.enabled=Enabled
atxy7o.menu.bodmodesleep.sampled=Sampled
atxy7o.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
atxy7o.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
atxy7o.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
atxy7o.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
atxy7o.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
atxy7o.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
atxy7o.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10

atxy7o.menu.dacvref.0v55=0.55V
atxy7o.menu.dacvref.1v1=1.10V
atxy7o.menu.dacvref.1v5=1.50V
atxy7o.menu.dacvref.2v5=2.50V
atxy7o.menu.dacvref.4v3=4.30V
atxy7o.menu.dacvref.0v55.build.dacvref=-DDACVREF=0
atxy7o.menu.dacvref.1v1.build.dacvref=-DDACVREF=1
atxy7o.menu.dacvref.1v5.build.dacvref=-DDACVREF=4
atxy7o.menu.dacvref.2v5.build.dacvref=-DDACVREF=2
atxy7o.menu.dacvref.4v3.build.dacvref=-DDACVREF=3

atxy7o.menu.millis.enabled=Enabled
atxy7o.menu.millis.disabled=Disabled (saves flash)
atxy7o.menu.millis.enabled.build.millis=
atxy7o.menu.millis.disabled.build.millis=-DDISABLEMILLIS

